
all_features_list=["电压极值","温度极值","电压差","温度差","电压方差","温度方差","电压熵","温度熵","温升","等效循环数","完整充电时间",
              "完整放电时间","等压升充电时间","等效直流内阻","等效电路内阻","等效电路电容","可放出电量","容量衰减斜率","自放电率",
              "容量方差","弛豫电压特征","ICA特征","SEI膜厚度","LAM","LLI"]

available_features=["电压极值","电压差","电压方差"]


def features_functions_recommend():
    all_functions = {"3Sigma隐患分析": 0, "不一致性预测分析": 0, "多维度特征综合评分算法": 0, "基于状态表示法的预警": 0, "基于相关系数法的内短路": 0,
                     "基于RCC的内短路": 0, "基于模型的内短路": 0, "析锂": 0, "容量异常跳水": 0, "老化模式辨识": 0, "异常自耗电": 0,
                     "基于RC/经验模型的SOH估计": 0, "基于机器学习的SOH估计": 0, "基于曲线拟合的寿命预测": 0, "基于机器学习的寿命预测": 0, "容量增量分析": 0,
                     "直流内阻计算": 0, "传感器异常排查": 0, "连接铜牌异常排查": 0, "电化学机理分析": 0, "运行倍率统计": 0, "搁置SOC统计": 0, "环境温度分析": 0,
                     "初始不一致性分析": 0, "早期循环衰减率分析": 0, "早期循环能量效率分析": 0, "制造缺陷分析": 0}

    #有一些实际上和中间特征有无并没有关系，原始数据有就能算
        # 状态表示法、相关系数法、运行倍率统计、搁置SOC统计、环境温度分析、初始不一致性分析、早期循环衰减率分析、早期循环能量效率分析、传感器异常排查

    #有一些还需要有额外条件
        #基于RCC的内短路，要工况是恒流/CCCV、低倍率，还需要给一条充电曲线
        #

    #有一些是只要满足其中一些，就可以用
        #多维度特征综合评分算法，有一些就行

        #不一致性预测，差值或者方差或者熵，有一些就行

        #3Sigma隐患分析，同上

        #SOH和RUL的，有一些就行

        #异常容量跳水，用特征或者容量能做

        #已经存在一部分ICA特征，说明容量增量分析还能深入做

    #有一些是必须要条件都满足，才能用
        #铜牌是要有直流内阻
        #析锂要有弛豫电压特征
        # 异常自耗电要有自放电率
        #基于模型的内短路要有R、C参数。基于RC／经验模型的SOH估计也是。
        #老化模式辨识需要ICA特征


    return all_functions